export const data = '' +
    '[\n' +
    '    {\n' +
    '        "clusterName": "Cluster 0",\n' +
    '        "wordfrequency": [\n' +
    '            "损坏",\n' +
    '            "判断",\n' +
    '            "电枢",\n' +
    '            "登机",\n' +
    '            "绝缘",\n' +
    '            "风机",\n' +
    '            "检查",\n' +
    '            "pc",\n' +
    '            "短路",\n' +
    '            "发现"\n' +
    '        ],\n' +
    '        "fault": [\n' +
    '            {\n' +
    '                "faultName": "变桨电机电流不对称",\n' +
    '                "faultNum": 11,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 风机报变桨电机电流不对称，主控观察面变桨电机电流为登机检查轮毂内无异物卡涩检查变桨电机抱闸线圈供电正常，手动变桨发现变桨电机抱闸接触器K合异常借用业主备件更换后故障消除。",\n' +
    '                        "ration": 0.56\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 检查发现第二面变桨电机电枢对地绝缘为，第三面电枢对地绝缘为，两台电机均对地绝缘不足，需更换。",\n' +
    '                        "ration": 0.58\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 对变桨电机进行更换处理。",\n' +
    '                        "ration": 0.67\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 检查轴片是否回到限位开关位置检查轴桨电机电枢，励磁绕组是否存在对地短路情况更换损坏的备件。",\n' +
    '                        "ration": 0.65\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "5. 经检查，第三面变桨时电机电流为左右，高出其他面左右，偶尔产生顺时电流接近，导致报警现场开票后到机位处理，检查发现第二面电机转动是声音正常，电机无内部和对地短路情况检查该面润滑，发现该面分配器堵塞怀疑因分配器堵塞导致轴承润滑不良报警。",\n' +
    '                        "ration": 0.57\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "61c22c94-4793-43fd-8d5c-ba54473b19a5",\n' +
    '                    "33fb4c78-7038-40b0-818b-26e67339f53c",\n' +
    '                    "5cb28dd5-11e7-447b-9e38-7922fade5062",\n' +
    '                    "a231520a-5c31-4df4-8614-bbe9d159b081",\n' +
    '                    "1d8f62be-5ff7-46ae-a615-4f4cbf56932d",\n' +
    '                    "fc7ee6c9-e2ee-4600-bb8e-ae825f7b951b",\n' +
    '                    "b28f73d8-7232-4b94-ac79-1c28fc9f7810",\n' +
    '                    "09a307e2-ed5f-4b6b-8d8b-53ecf54a0320",\n' +
    '                    "7872c03a-9ecd-4ecc-ac47-9e20b9015474",\n' +
    '                    "605322e9-c137-4476-8e78-44a824d326a4",\n' +
    '                    "3632c5ef-a384-474a-9644-83c66aa38f3a"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "轴2MPC故障",\n' +
    '                "faultNum": 11,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查轴动器报IGBT过流，检查变桨电机电枢，励磁对地绝缘只有左右，电机对地短路检查其它部件及线路未发现异常。",\n' +
    '                        "ration": 0.82\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 测量电机励磁对地绝缘确认电机轴承状态确定变桨电机是否损坏。",\n' +
    '                        "ration": 0.62\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 检查轮毂内无异物卡塞，触发变桨电机抱闸声音正常手动变桨观察发现电机内异响较大，有卡塞，电流较大将电机取下检查齿轮箱无异常单独给电机通电后变桨发现内部异响卡塞故判断变桨电机损坏。",\n' +
    '                        "ration": 0.94\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "e27ad029-51c0-4b0a-882c-6a79160f1e3b",\n' +
    '                    "f5b1985d-5160-45d2-bcf5-0ef6fafeb311",\n' +
    '                    "e7efd290-63d2-41ec-85a6-784d72a6749f",\n' +
    '                    "ff2e5fa7-0a58-495b-85a5-5296e1b84812",\n' +
    '                    "227c5055-b5f1-4854-9d52-5bb2bfb91dd1",\n' +
    '                    "f79998c7-8f63-4533-b448-39b91b096e7a",\n' +
    '                    "7a11ad5f-9bc0-415e-87f8-4dc472267ca6",\n' +
    '                    "258ddc35-603e-4a3f-9256-3e91c5c78c85",\n' +
    '                    "d180160e-c46f-4c2e-a9da-0f84aad8bdb8",\n' +
    '                    "267b3caf-aebb-4e3b-b7b0-4c08e03696d2",\n' +
    '                    "e2e59a8a-82c1-417f-a678-c115a9f6b5b2"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨小错误",\n' +
    '                "faultNum": 10,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查发现轴关跳开，检查线路未发现短路情况测量变桨电机电枢励磁对地绝缘左右更换变桨电机后故障消除。",\n' +
    '                        "ration": 0.98\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 检查变桨轴控柜闸是否故障检查F载变桨电机是否损坏。",\n' +
    '                        "ration": 0.8\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 检查发现轴角在与设定桨角不一致故报出故障现场轴手操盒变桨至故障消除现场试运行时停机过程中，发现轴角还是会跑到。",\n' +
    '                        "ration": 0.94\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 运维人员登机检查轴制柜F开跳闸。",\n' +
    '                        "ration": 0.8\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "5. 登机检查变桨电机抱闸能正常打开测量电机绕组之间测量绕组对地短路。",\n' +
    '                        "ration": 0.66\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "9a2b8fd5-26e1-4bfd-9bcb-103591a759b6",\n' +
    '                    "221454f0-6a8e-4a6c-90b0-3100e346491c",\n' +
    '                    "ef8113d2-e84c-4fc6-a042-68b961619369",\n' +
    '                    "2e9e59f8-8f5e-4042-a880-cb4dfb735238",\n' +
    '                    "0a05ec34-458c-4d33-be52-113fdca24b90",\n' +
    '                    "fbed9ad7-0861-4824-a1ac-b42b1f5f156f",\n' +
    '                    "c179f07f-9ef7-404a-8865-925fd6e9b650",\n' +
    '                    "26d5ca1e-b03b-4ab4-b209-d9fccdb9a1ea",\n' +
    '                    "5deda269-0d66-467f-88b2-5314b5865cd0",\n' +
    '                    "da88d10c-dcca-4a49-9630-10be19e84ed2"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "轴3MPC故障",\n' +
    '                "faultNum": 9,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 测量电机励磁对地绝缘确定变桨电机已损坏。",\n' +
    '                        "ration": 0.88\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 借用业主备件更换后故障消除。",\n' +
    '                        "ration": 0.82\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 刚开浆机组立刻报轴PC故障，登机检查面内齿圈无异物卡塞，检查变桨电机电枢，励磁对地绝缘电机对地短路。",\n' +
    '                        "ration": 0.9\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "75c6854a-9e58-4388-8e72-f58ed1756f4f",\n' +
    '                    "128779a2-4a16-441a-a924-d0fa5db6b2ef",\n' +
    '                    "ecbf6f24-21ec-4cd4-8f33-d174403083ae",\n' +
    '                    "d413968e-cc9b-400e-8f68-0953527555a1",\n' +
    '                    "01160832-c9ea-4be6-afe8-e6ab2fd26650",\n' +
    '                    "6ee2f8da-9e5e-48af-b849-5866b69d15d2",\n' +
    '                    "cb0a3d12-3d3e-4d49-bae5-67b6287ddcdb",\n' +
    '                    "6cb555b0-8e53-41fd-83a5-b165bd58b1c6",\n' +
    '                    "5b70e574-a357-47c7-83e4-53e55580ecfa"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "轴1MPC故障",\n' +
    '                "faultNum": 7,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 检查轴桨电机电枢，励磁对地绝缘检查电机对地短路检查其它线路及部件。",\n' +
    '                        "ration": 0.52\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 主控观察启机开浆时面电流左右登机检查轮毂内无异物卡塞检查轴桨电机抱闸是否松开测量刹车线圈供电是否正常检查抱闸刹车接触器吸合是否正常。",\n' +
    '                        "ration": 0.86\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 登机检查发现轴桨电机绕组地绝缘正常应为无穷大现判断变桨电机损坏。",\n' +
    '                        "ration": 0.65\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "e5678848-775a-4be4-8ad4-6c1096f85403",\n' +
    '                    "54973c59-9b09-4608-bac5-685600e44c7c",\n' +
    '                    "7cbb40ea-f25e-4b01-adeb-4ef70059c514",\n' +
    '                    "4bf22600-6b5a-4198-9869-0270c40dfbfe",\n' +
    '                    "f5525196-9a9b-4b22-9a9a-d1070f8e2dbc",\n' +
    '                    "3436e4d3-4402-4990-a8f5-a79fb335f8c1",\n' +
    '                    "7588e7af-a97b-47d0-a76e-78e9b9a47c53"\n' +
    '                ]\n' +
    '            }\n' +
    '        ]\n' +
    '    },\n' +
    '    {\n' +
    '        "clusterName": "Cluster 1",\n' +
    '        "wordfrequency": [\n' +
    '            "错误",\n' +
    '            "故障",\n' +
    '            "报变",\n' +
    '            "变桨",\n' +
    '            "收桨",\n' +
    '            "交流",\n' +
    '            "速度",\n' +
    '            "机组",\n' +
    '            "桨叶",\n' +
    '            "风机"\n' +
    '        ],\n' +
    '        "fault": [\n' +
    '            {\n' +
    '                "faultName": "桨叶3交流收桨速度过慢",\n' +
    '                "faultNum": 10,\n' +
    '                "maintenanceMeasures": [],\n' +
    '                "caseUuid": [\n' +
    '                    "dc4b71c7-7d43-4c88-b8a3-3d09096ae99b",\n' +
    '                    "294390cf-3245-408a-91e2-735b05db5b8a",\n' +
    '                    "3b82cfeb-7678-4efc-acea-f21ca5942898",\n' +
    '                    "aa784cf6-ecd8-4232-860f-59ab09afa335",\n' +
    '                    "3f4bedba-ba45-4862-a56a-9a33147aede8",\n' +
    '                    "ab843429-812a-49b2-b700-0ae638cd9d7b",\n' +
    '                    "aef86116-384f-4f0a-93f9-368f968afc74",\n' +
    '                    "3ea3828e-70d2-472f-b85d-7ba9200a0d17",\n' +
    '                    "cd62416c-7f77-4c34-a638-3c5578501798",\n' +
    '                    "c6fc808f-4376-4d4e-a7bf-53e482264361"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨1错误",\n' +
    '                "faultNum": 10,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 排查编码器正常，变桨电机在开桨时有异响，开桨速度不一致，判断变桨电机轴承磨损将变桨电机拆下发现变桨电机轴承磨损，平健，输入布套磨损。",\n' +
    '                        "ration": 0.95\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 处理故障时发现变桨机散热风扇壳体铆钉脱落导致风扇损坏，风扇罩壳损坏。",\n' +
    '                        "ration": 0.72\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "c3af83f0-0a17-421a-9b77-6167226ea731",\n' +
    '                    "3acebd96-936a-497b-af0e-5fe569277dc1",\n' +
    '                    "69b68770-5aa5-4570-bee1-4508becf3ddc",\n' +
    '                    "10acc84e-3020-4f65-937c-7e9c793e7f67",\n' +
    '                    "09166d4b-c67c-49cb-9e8a-d6e034882c00",\n' +
    '                    "e3668c95-01b2-449c-8c6a-07d38cac2d70",\n' +
    '                    "cb772e7f-b42c-4d75-aabd-75f18af276b1",\n' +
    '                    "05bce511-fa62-4678-8a12-d1da994cdf96",\n' +
    '                    "d077e2ca-fa8b-42f8-a41d-3fa10b1c5f1d",\n' +
    '                    "bfb8e19f-6b3e-400a-8755-54310fe5fba4"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨WarnTcu故障",\n' +
    '                "faultNum": 8,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 检查发现机组桨三桨叶无法正常收桨排查变桨电机，发现桨三变桨电机三项平衡正常，对地绝缘阻值为零判断变桨电机损坏。",\n' +
    '                        "ration": 0.93\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "bc809359-a599-45ed-a0f6-e282425c1e1b",\n' +
    '                    "294b121d-9b5a-4dce-b897-d935dafff7b8",\n' +
    '                    "878b1dd9-2527-48bb-b9fe-e34e01bb8ece",\n' +
    '                    "c988ebb7-029c-47ca-9c83-d49d6c4c0d6d",\n' +
    '                    "71f817b2-2316-43e5-8d6f-f40bf8c992d1",\n' +
    '                    "b95f113d-e310-4aed-a40c-96f2b2ce2b3f",\n' +
    '                    "b95ab086-a565-4d8f-841a-c327385f53b6",\n' +
    '                    "671716c6-3c7a-4684-86cd-7a24f21a9412"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨A类故障",\n' +
    '                "faultNum": 8,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 首先用电脑链接变桨控制器程序，发现报：轴三桨角偏差过大，轴三AC/DC电源模块故障。对线路和模块进行检查，未发现线路和模块异常。又用电脑链接轴三伦茨驱动器程序，发现报：轴三伺服驱动急停，直流母线欠压。对直流母线输入，输出线路检查未发现异常。后用手操盒对轴三进行手动变桨，发现变桨系统不动作。之后对轴三变桨电机进行拆卸，继续用手操盒对变桨电机手动测试，发现电机卡死。又对变桨齿轮箱进行检查，发现无异常。。",\n' +
    '                        "ration": 0.71\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 经登机使用手操盒进行手动回桨更换新的变桨电机。",\n' +
    '                        "ration": 1.0\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "7ff8fdf1-9447-49aa-82de-de2f68d7d379",\n' +
    '                    "84ea2200-d7b3-4d7f-b0e8-b0f631b79d32",\n' +
    '                    "3a69a000-237a-4916-b47e-13ddb6b02472",\n' +
    '                    "0a56f8d1-0600-46ba-abc6-e01f2c11a938",\n' +
    '                    "32cd6d9e-8ff6-4174-a6a6-d454f383dd72",\n' +
    '                    "7de90df4-9047-4fa9-998a-5fd1b7a584d1",\n' +
    '                    "8d8ad247-0a76-4a10-97d3-c02f68ddcc85",\n' +
    '                    "ce128b4f-0ce5-43b3-a902-7a4728100135"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨1驱动器错误",\n' +
    '                "faultNum": 6,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查发现变桨电机空载运行存在卡涩情况，现场判断电机轴承损坏使用业主备件进行更换后故障消除机组恢复正常运行。",\n' +
    '                        "ration": 0.69\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 变桨驱动器运行异常变桨电机运行异常。",\n' +
    '                        "ration": 0.75\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "34c67c79-8d0e-4340-b3e3-88ac20058ba0",\n' +
    '                    "1e80d454-490a-48ed-a824-30f116c81c0f",\n' +
    '                    "c90d61b5-78b5-44ea-870f-2d76c4bd541b",\n' +
    '                    "cb890ed1-8fda-447b-b16a-b2f57c8f4bb9",\n' +
    '                    "234c8bbf-01ac-4e22-b67f-3e06c55e5166",\n' +
    '                    "5452f15e-fb8a-4a26-aa9c-bf910d258ec7"\n' +
    '                ]\n' +
    '            }\n' +
    '        ]\n' +
    '    },\n' +
    '    {\n' +
    '        "clusterName": "Cluster 2",\n' +
    '        "wordfrequency": [\n' +
    '            "过流",\n' +
    '            "流变",\n' +
    '            "电机",\n' +
    '            "桨叶",\n' +
    '            "变桨",\n' +
    '            "热继过",\n' +
    '            "风机",\n' +
    '            "后台",\n' +
    '            "机组",\n' +
    '            "同步"\n' +
    '        ],\n' +
    '        "fault": [\n' +
    '            {\n' +
    '                "faultName": "变桨电机过流",\n' +
    '                "faultNum": 10,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查变桨电机发现，手动变桨时有卡涩情况，导致变桨电流过高电机运行不正常检查电机刹车，电气回路等都正常需更换变桨电机。",\n' +
    '                        "ration": 0.96\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 人员上塔检查发现为桨叶桨电机轴承损坏导致，现已经故障停机，需更换。",\n' +
    '                        "ration": 0.54\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 登机检查发现叶片螺栓断裂一颗，卡在了变桨齿轮箱齿面以及变桨轴承齿面之间现场通过查找发现该面桨叶断裂的螺栓与去年发现的断裂的两颗螺栓保持了距离（其中一颗已经安装了新的螺栓，另外一颗因有片刀镶嵌在了螺栓上）请公司安排专业的检修人员到场进行处理另业主想咨询一下公司技术这边，同一个面断裂三颗螺栓是否存在大的安全隐患，后续如何检查处理。",\n' +
    '                        "ration": 1.0\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "afba1b16-ebcd-44a0-93ad-db0337e016c3",\n' +
    '                    "31dcd3a5-441c-49ef-ae7e-82581cbc9a2d",\n' +
    '                    "98b00f67-7694-4c28-95c0-91f5e09fef26",\n' +
    '                    "93b82af3-877b-4373-a613-065c36369f89",\n' +
    '                    "56977ead-956c-4dd3-ac1e-c37b3f133013",\n' +
    '                    "5cf23dcf-7aa9-43e7-b0a8-ea0dba3ed20d",\n' +
    '                    "b08dcda9-7443-40b1-a0ce-033806a57e10",\n' +
    '                    "ddcb2f53-be59-4e44-804a-33c9c1c35fc4",\n' +
    '                    "666cca54-be38-4a1a-ad87-9b8aaa583b05",\n' +
    '                    "0e1a9af9-a4c2-4982-89dd-7d75df982cea"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机2过流",\n' +
    '                "faultNum": 9,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 人员检查发现为变桨电机轴承卡涩导致电机过流损坏。",\n' +
    '                        "ration": 0.7\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 风机报桨叶机过流检查发现轴制柜流桥损坏测量正反两项导通需更换整流桥。",\n' +
    '                        "ration": 0.58\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 报此故障时桨叶桨速度过慢登机检查驱动器以及读取内部数据，驱动器报漏电检查变桨电机测量变桨电机绕组对地短路，且电机有糊味更换变桨电机。。",\n' +
    '                        "ration": 0.77\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 检查面叶片螺栓解决断裂叶片螺栓问题清理齿轮箱齿面。",\n' +
    '                        "ration": 0.9\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "6f67d3a3-6ea1-4761-bbc2-b8c7a096f2cb",\n' +
    '                    "22ca3496-16ec-4d37-821d-243aec703e88",\n' +
    '                    "47764326-81f3-43bf-a6c9-a17b829f1ba8",\n' +
    '                    "6150c1de-9606-4d62-b9e9-ccb095103278",\n' +
    '                    "5872f065-a140-4b88-bb15-74d67ab338de",\n' +
    '                    "7114ae27-b1d0-49f8-8a56-42d4a739c465",\n' +
    '                    "da437935-b407-4cd2-ad32-cca1ce8afa69",\n' +
    '                    "87f7593a-5518-4ed6-a04b-6b4ec3ff6a55",\n' +
    '                    "ded03b32-af8a-43e4-9023-4026df462514"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "桨叶2变桨电机过流",\n' +
    '                "faultNum": 8,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 人员上塔检查发现为桨叶桨电机轴承损坏导致现场无备件，望公司尽快发货。",\n' +
    '                        "ration": 0.55\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "57cf997d-292f-4aed-86d3-a672bbdd26b5",\n' +
    '                    "0cf4c2b3-9aff-45d2-920e-1a54a5be8d74",\n' +
    '                    "f0e9b235-ecf8-45f8-868f-8a2ea70d4f63",\n' +
    '                    "687caa5f-9ce9-4f82-a45b-2ed33fdf1559",\n' +
    '                    "2f1adfd3-014a-4be1-b8d7-161661bdc7fd",\n' +
    '                    "091f2c0a-fb69-4480-9f86-7acc09b941a0",\n' +
    '                    "64e1f527-776c-464f-9b1c-b19adacb60d9",\n' +
    '                    "db5b0718-28dd-46ea-99be-d229f4aa2101"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "桨叶3变桨电机过流",\n' +
    '                "faultNum": 6,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 人员上塔检查发现为桨叶桨电机轴承损坏导致，现已经故障停机需更换桨叶桨电机轴承。",\n' +
    '                        "ration": 0.51\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "c4120a6f-c738-4038-96ad-7cfffe083dd5",\n' +
    '                    "edf6beec-90ba-4216-8a61-05b237527882",\n' +
    '                    "12413ee8-aa79-4973-b215-024d66900658",\n' +
    '                    "34a23f72-2f61-4214-a42b-dab0404f8f2a",\n' +
    '                    "60d3a9e9-6ba9-4b9b-b2c8-4eea50bb8e2f",\n' +
    '                    "586e784c-db28-4c1a-956c-3d2a73630ca0"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "桨叶1变桨电机过流",\n' +
    '                "faultNum": 6,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 人员上塔检查发现为桨叶桨电机轴承损坏导致，现已经故障停机需更换桨叶桨电机轴承。",\n' +
    '                        "ration": 0.56\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "c4c499fa-eeb3-41ed-947e-25f28516ae46",\n' +
    '                    "1e38d39e-e597-405e-9bc6-fc30938a35ca",\n' +
    '                    "92538f8b-eadf-4349-be4c-89bb9711acab",\n' +
    '                    "821735fd-3101-4a26-8592-ccb03d81f273",\n' +
    '                    "feeac6a8-586e-4267-9c56-27fd262142a3",\n' +
    '                    "63045c49-4e04-470b-9335-990659ce0e80"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机2、3过流",\n' +
    '                "faultNum": 6,\n' +
    '                "maintenanceMeasures": [],\n' +
    '                "caseUuid": [\n' +
    '                    "b9ae73f1-d8c1-4bfc-a9f4-033a37ca0ea4",\n' +
    '                    "9ea4c93a-d0c0-4798-a0fd-723b061dda42",\n' +
    '                    "fb71f38a-eb03-4e6d-8972-d1e1896eaa62",\n' +
    '                    "90eb28bb-caa3-4b0b-a3de-4743430e9362",\n' +
    '                    "1068bc0d-c23c-4644-a98d-d9bed4337ffa",\n' +
    '                    "c82e92c4-ba90-4c19-9c8d-f5865906c15c"\n' +
    '                ]\n' +
    '            }\n' +
    '        ]\n' +
    '    },\n' +
    '    {\n' +
    '        "clusterName": "Cluster 3",\n' +
    '        "wordfrequency": [\n' +
    '            "同步",\n' +
    '            "电流",\n' +
    '            "电机",\n' +
    '            "变桨",\n' +
    '            "对称",\n' +
    '            "过大",\n' +
    '            "报变",\n' +
    '            "机组",\n' +
    '            "报警",\n' +
    '            "风机"\n' +
    '        ],\n' +
    '        "fault": [\n' +
    '            {\n' +
    '                "faultName": "变桨电机电流不同步",\n' +
    '                "faultNum": 32,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机后排除驱动器使能及EFC信号后，手动变桨依然不动作，且电机发出异响声音，电流值高达，但电机输出及抱闸电源正常，取出电机进行空转运行时，电机收桨及开桨无动作，测试电机三相绕组正常判断为轴承损坏，现场无备件更换，故障停机。",\n' +
    '                        "ration": 0.84\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 查明故障数据时发现轴变桨电机电流已达，登机检查变桨电机输出端电源正常手动变桨时检查电机轴承是否存在异响及卡塞现象更换新件。",\n' +
    '                        "ration": 0.77\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 登机检查变桨系统，无明显异物，排除变桨轴承卡滞导致电流不同步尝试对桨叶进行走桨，桨叶可以动作，声音正常桨叶过程中有较大的异常，怀疑是电机异常尝试更换新电机，更换完带启动电机无异响启机观察故障消除，确定变桨电机失效。",\n' +
    '                        "ration": 0.77\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 登机检查轴三电机输出端电源正常，电机三相平衡手动开桨时电机抱闸打开，轴承异响严重并伴有卡塞判定为电机轴承存在中期损坏。",\n' +
    '                        "ration": 0.89\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "5. 登机检查未发现明显异常点，连接变桨PLC后发现轴动器保电机短路断电后拆开变桨电机电源连接线，发现内部已烧糊。",\n' +
    '                        "ration": 0.65\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "6. 风机报变桨电机电流不同步故障上机检查，轴桨电机电流比较大检查轴，伺服驱动器端子排烧损判断伺服驱动器内部故障。",\n' +
    '                        "ration": 0.89\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "7. 登机发现驱动器抱闸端子有明显烧坏现象，内部针头被烧断，驱动器无法正常使用,将其更换后手动变桨测试，发现电机内部抱闸无法松开检查线路无异常，判定为电机抱闸损坏，将其更换后故障消除。",\n' +
    '                        "ration": 0.53\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "8. 更换全新的变桨电机。",\n' +
    '                        "ration": 0.84\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "9. 手动检查变桨电机判断轴承损坏启动轴承维修方案。",\n' +
    '                        "ration": 0.62\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "10. 现场人员登机查看风机状态，变桨过程中电机发出明显异响现场判断电机失效拆下风机桨叶变桨电机，对电机（未连接变桨齿轮箱情况下）进行送电测试，电机异响严重判断电机损坏。",\n' +
    '                        "ration": 0.9\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "11. 检查变桨状态，分别手动变桨观察。桨一手动变桨无动作电机抱闸打开后电机无动作使用万用表测量电机绕阻异常电机损坏需更换。",\n' +
    '                        "ration": 0.74\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "12. 远程观察发现桨叶A/B编码器角度停在登机检查，在手动拖动桨叶时，桨叶电机以及齿轮箱处发出异响再次登机检查，拖动桨叶，发现已无法进行开桨，只能往方向进行变桨，且只能拖动左右，就卡滞不动作检查变桨轴承以及齿面，未发现异常，变桨轴承排除的油脂里面也未发现金属粉末以及颗粒根据故障现象和异响情况，怀疑减速器低速级行星齿轮断裂卡死。",\n' +
    '                        "ration": 0.95\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "13. 现场运维人员登机检查发现轴机的流互感器有烧坏的痕迹故判断为机电流互感器损坏。",\n' +
    '                        "ration": 0.57\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "14. 现场自行维修。",\n' +
    '                        "ration": 0.73\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "15. 登机检查发现轴桨电机过载触发后备电源紧急收桨报出故障检查轴桨电机发现电机电枢绕组对地短路更换变桨电机。",\n' +
    '                        "ration": 0.91\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "7326028e-823d-440d-972f-9e22b9161908",\n' +
    '                    "e2c68d34-69a9-4001-bfd8-da2cab1c19a1",\n' +
    '                    "4adb75ad-21bb-4cf8-8919-2f0a949e57f6",\n' +
    '                    "52502375-10e8-4c8f-bc0e-cd08d3912a11",\n' +
    '                    "e00f08b8-900a-4229-bea6-21a9822d291d",\n' +
    '                    "e459556e-2386-4740-94cf-5ca58f6f53d7",\n' +
    '                    "a74d9fbb-82cc-4763-861b-84b7275ac806",\n' +
    '                    "c453996e-4ae5-4388-af44-61479ca56168",\n' +
    '                    "c0d62623-ea48-434c-a7b3-e49177d1dc21",\n' +
    '                    "925fafe3-93bb-476c-89b8-9e0c2a9c2071",\n' +
    '                    "d7642b05-7c9a-4b56-a492-ef3a33369e83",\n' +
    '                    "f0693080-ce37-4999-8a58-124b67012e28",\n' +
    '                    "1f2ae5e1-3c82-46a0-84da-9978449d8467",\n' +
    '                    "9fa00339-f1ad-4953-ad6c-47c807ea20e2",\n' +
    '                    "6580c8ef-a414-45dd-a3dd-98e236485ebb",\n' +
    '                    "c37bf70c-650c-4117-8b82-c6ae69a7c2d6",\n' +
    '                    "1524d6d3-60ee-4273-b433-84eeb5e9dd33",\n' +
    '                    "03a1ac4d-1916-4a9d-825b-94abe373d321",\n' +
    '                    "19a95626-bf87-4a29-8ad5-41556ee42cd8",\n' +
    '                    "2e3c5ec1-731f-4e3c-abca-dc2cf2f026c3",\n' +
    '                    "20e616ec-eea2-48b4-8aee-bedebdec5a1c",\n' +
    '                    "e6b4c3ca-2ecd-4454-b123-43eca9ae21b7",\n' +
    '                    "88e7128f-3b94-4e20-b8b9-4a3bf4306ec9",\n' +
    '                    "132aa5e7-30c1-40b2-80e2-07722762bca0",\n' +
    '                    "1e897fdc-1562-4f63-b3a6-af32b2c0a232",\n' +
    '                    "2eda7fb0-597a-4729-bdbd-c2b618b0a60d",\n' +
    '                    "54512fe7-8294-4d4d-b558-845d373547f5",\n' +
    '                    "d0e8f3e9-49bf-458c-a004-851ebe9fc05c",\n' +
    '                    "30357e72-17af-455a-961c-d1058bc842cc",\n' +
    '                    "8f0ac946-041b-4951-adfb-5f5b04b8a4e1",\n' +
    '                    "0fc559df-674b-4fdd-a3da-dc53e53c8938",\n' +
    '                    "22e51dbe-1ad8-41c4-8f61-87bd74d57646"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机电流不对称",\n' +
    '                "faultNum": 11,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 风机报变桨电机电流不对称，主控观察面变桨电机电流为登机检查轮毂内无异物卡涩检查变桨电机抱闸线圈供电正常，手动变桨发现变桨电机抱闸接触器K合异常借用业主备件更换后故障消除。",\n' +
    '                        "ration": 0.61\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 检查发现第二面变桨电机电枢对地绝缘为，第三面电枢对地绝缘为，两台电机均对地绝缘不足，需更换。",\n' +
    '                        "ration": 0.76\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 对变桨电机进行更换处理。",\n' +
    '                        "ration": 0.94\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 检查轴片是否回到限位开关位置检查轴桨电机电枢，励磁绕组是否存在对地短路情况更换损坏的备件。",\n' +
    '                        "ration": 0.6\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "5. 经检查，第三面变桨时电机电流为左右，高出其他面左右，偶尔产生顺时电流接近，导致报警现场开票后到机位处理，检查发现第二面电机转动是声音正常，电机无内部和对地短路情况检查该面润滑，发现该面分配器堵塞怀疑因分配器堵塞导致轴承润滑不良报警。",\n' +
    '                        "ration": 0.87\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "6cb2d86f-bdce-40f2-809a-f7d48cfb9d2f",\n' +
    '                    "efaae4a1-b348-4486-b44c-d51d0d9e81a6",\n' +
    '                    "b88493ee-4b07-4957-8dca-219586f7ffd8",\n' +
    '                    "61e2cb74-f445-413e-abb7-78d4983749f0",\n' +
    '                    "9fde0457-8dd8-4879-a9da-2d4f527722e7",\n' +
    '                    "76a5ca33-9ef3-484e-b1cd-038d29f8dad4",\n' +
    '                    "e5d1f04a-4062-444a-a7d8-33b368b40fc2",\n' +
    '                    "a0a4e933-37f2-43fd-a685-db16ee65fe38",\n' +
    '                    "8a1b0151-413e-428a-867a-d3db4b4962b2",\n' +
    '                    "bf8e1d5f-af09-432c-8ca3-7be71b1b446a",\n' +
    '                    "afa18668-2696-4799-a272-a56b460b0542"\n' +
    '                ]\n' +
    '            }\n' +
    '        ]\n' +
    '    },\n' +
    '    {\n' +
    '        "clusterName": "Cluster 4",\n' +
    '        "wordfrequency": [\n' +
    '            "电机",\n' +
    '            "变桨",\n' +
    '            "桨叶",\n' +
    '            "故障",\n' +
    '            "发现",\n' +
    '            "检查",\n' +
    '            "机组",\n' +
    '            "偏差",\n' +
    '            "温度",\n' +
    '            "角度"\n' +
    '        ],\n' +
    '        "fault": [\n' +
    '            {\n' +
    '                "faultName": "桨叶间角度偏差",\n' +
    '                "faultNum": 31,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查发现轴桨电机绝缘正常登机检查发现抱闸阻值正常登机检查发现抱闸不动作登机检查发现电机卡死不动作。",\n' +
    '                        "ration": 0.98\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 检查发现桨叶动变桨抱闸打开不动作或桨叶动作（并伴有异响）后又不动作将变桨电机卸后变桨依然不动作手动变桨电机现变桨电机变桨时有异响。",\n' +
    '                        "ration": 0.73\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 根据现场描述，手动变桨，抱闸没有声音判断为变桨电机抱闸故障。",\n' +
    '                        "ration": 0.91\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 登机检查测量发现对地导通抱闸正常。",\n' +
    '                        "ration": 0.78\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "5. 检查后台数据发现故障时轴桨电机电流最大到，电机温度达登机检查变桨电机无异常进行手动变桨测试时电机抱闸打开一瞬间电机抱闸处冒白烟并伴有火光，测量抱闸电阻无穷大。",\n' +
    '                        "ration": 0.64\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "5bd0cdf4-bfcb-4692-9d06-e10e79e52ce4",\n' +
    '                    "b11183eb-ddc1-4c76-b3ad-00a8f4e133db",\n' +
    '                    "697123e9-e393-4811-abfc-cf2cbe46f689",\n' +
    '                    "07c9f94a-a3fe-417a-a5d5-083d12cc021a",\n' +
    '                    "2a5bc4b1-caed-4fe2-9b4e-4044733c5503",\n' +
    '                    "d7dd21bc-7a0a-4144-af03-012bc9344b83",\n' +
    '                    "8d884cf2-bf8c-48fe-9776-59807d1a10e7",\n' +
    '                    "b23f8800-e4cb-4df1-90ea-9e41ef921a27",\n' +
    '                    "7fc70405-8f8e-49be-b866-821977076fbd",\n' +
    '                    "13322707-822c-4d3f-9785-c3e1015c3b1a",\n' +
    '                    "553c5b38-c8ea-4a83-8928-687d285821d9",\n' +
    '                    "351bb238-2b36-49a0-81a5-ec4caa91a8cd",\n' +
    '                    "6305cc59-19c8-4f31-8d2c-4c4a828fe524",\n' +
    '                    "23590a0e-3de9-445a-a695-293be7e51d8e",\n' +
    '                    "85a55f75-6a59-478e-99e6-c2359544abe8",\n' +
    '                    "4281d40e-2c38-43bb-86ea-00da215cb742",\n' +
    '                    "ea676989-b71c-4817-afbc-c9dbcc5ee366",\n' +
    '                    "787bbf5d-d76e-4c2d-a53d-f05cb4fb2f21",\n' +
    '                    "a211f304-237e-4e0f-af88-657cb0eb02c6",\n' +
    '                    "60c8e5c1-8337-449d-a294-349117304046",\n' +
    '                    "bf4b70a0-c66c-4f93-b5fd-0a06aaa16eb1",\n' +
    '                    "a2d252bc-c356-4d05-922f-4295c87675a1",\n' +
    '                    "b2584fa9-2f79-4797-a204-2681eb539195",\n' +
    '                    "940b649c-a60d-42e3-a08b-b10233cfbd10",\n' +
    '                    "11d7c16f-9ad9-4220-a572-ebe648c7605d",\n' +
    '                    "2ba0f002-c41e-4f98-ba9f-877683ece4ff",\n' +
    '                    "8fa895d0-3335-403b-aa81-2645080bcbe6",\n' +
    '                    "776e826f-0a82-46d3-84de-04816bc692b8",\n' +
    '                    "58b36659-f8c3-44b1-8bc9-c77385ffe3cb",\n' +
    '                    "02655411-ef63-4440-b05d-0d2eed0a1132",\n' +
    '                    "49ae3c50-7fb8-4153-a70a-867a63eb4312"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨小错误",\n' +
    '                "faultNum": 16,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查发现轴关跳开，检查线路未发现短路情况测量变桨电机电枢励磁对地绝缘左右更换变桨电机后故障消除。",\n' +
    '                        "ration": 0.89\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 检查变桨轴控柜闸是否故障检查F载变桨电机是否损坏。",\n' +
    '                        "ration": 0.79\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 检查发现轴角在与设定桨角不一致故报出故障现场轴手操盒变桨至故障消除现场试运行时停机过程中，发现轴角还是会跑到。",\n' +
    '                        "ration": 0.97\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 运维人员登机检查轴制柜F开跳闸。",\n' +
    '                        "ration": 0.77\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "5. 登机检查变桨电机抱闸能正常打开测量电机绕组之间测量绕组对地短路。",\n' +
    '                        "ration": 0.87\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "16cb5cfd-f9c1-4f7e-82ce-2b952de039a7",\n' +
    '                    "4eb56020-82a5-4287-b02b-c2a0337cce63",\n' +
    '                    "0c62539a-587d-46de-9ea7-b21426b2d307",\n' +
    '                    "c5ca8e45-6661-4f25-8145-3dde0d4e347e",\n' +
    '                    "75ed3d66-f879-406f-ab82-5102e394eea9",\n' +
    '                    "de2a0dc2-afb5-4ff7-b252-c05ef528fd95",\n' +
    '                    "65e38ec6-ef2a-4347-afe3-51c071fb3a07",\n' +
    '                    "06f4b437-00b0-463f-a522-5e6d63aa029e",\n' +
    '                    "bbca99b2-3dd1-4d70-b6ff-ad1894284d8e",\n' +
    '                    "bed5da2a-c1a1-4d17-b84a-48cccc6a6f91",\n' +
    '                    "873085f5-0cc4-48dd-b8d7-10356e36b054",\n' +
    '                    "850e42ad-980e-4e7a-8887-d5bd146ffe6d",\n' +
    '                    "f9e82593-f131-4189-99af-98b0c0be8f8f",\n' +
    '                    "433a511a-c9a0-4d3e-bf13-d553acf95fca",\n' +
    '                    "84924670-5ce9-49d5-b0ff-9551bc4a28e2",\n' +
    '                    "0f29664c-7624-4fc8-8124-5ec04994c444"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机电流不同步",\n' +
    '                "faultNum": 13,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机后排除驱动器使能及EFC信号后，手动变桨依然不动作，且电机发出异响声音，电流值高达，但电机输出及抱闸电源正常，取出电机进行空转运行时，电机收桨及开桨无动作，测试电机三相绕组正常判断为轴承损坏，现场无备件更换，故障停机。",\n' +
    '                        "ration": 0.74\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 查明故障数据时发现轴变桨电机电流已达，登机检查变桨电机输出端电源正常手动变桨时检查电机轴承是否存在异响及卡塞现象更换新件。",\n' +
    '                        "ration": 0.71\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 登机检查变桨系统，无明显异物，排除变桨轴承卡滞导致电流不同步尝试对桨叶进行走桨，桨叶可以动作，声音正常桨叶过程中有较大的异常，怀疑是电机异常尝试更换新电机，更换完带启动电机无异响启机观察故障消除，确定变桨电机失效。",\n' +
    '                        "ration": 0.8\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 登机检查轴三电机输出端电源正常，电机三相平衡手动开桨时电机抱闸打开，轴承异响严重并伴有卡塞判定为电机轴承存在中期损坏。",\n' +
    '                        "ration": 0.94\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "5. 登机检查未发现明显异常点，连接变桨PLC后发现轴动器保电机短路断电后拆开变桨电机电源连接线，发现内部已烧糊。",\n' +
    '                        "ration": 0.84\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "6. 风机报变桨电机电流不同步故障上机检查，轴桨电机电流比较大检查轴，伺服驱动器端子排烧损判断伺服驱动器内部故障。",\n' +
    '                        "ration": 0.87\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "7. 登机发现驱动器抱闸端子有明显烧坏现象，内部针头被烧断，驱动器无法正常使用,将其更换后手动变桨测试，发现电机内部抱闸无法松开检查线路无异常，判定为电机抱闸损坏，将其更换后故障消除。",\n' +
    '                        "ration": 0.58\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "8. 更换全新的变桨电机。",\n' +
    '                        "ration": 0.67\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "9. 手动检查变桨电机判断轴承损坏启动轴承维修方案。",\n' +
    '                        "ration": 0.91\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "10. 现场人员登机查看风机状态，变桨过程中电机发出明显异响现场判断电机失效拆下风机桨叶变桨电机，对电机（未连接变桨齿轮箱情况下）进行送电测试，电机异响严重判断电机损坏。",\n' +
    '                        "ration": 0.79\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "11. 检查变桨状态，分别手动变桨观察。桨一手动变桨无动作电机抱闸打开后电机无动作使用万用表测量电机绕阻异常电机损坏需更换。",\n' +
    '                        "ration": 0.81\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "12. 远程观察发现桨叶A/B编码器角度停在登机检查，在手动拖动桨叶时，桨叶电机以及齿轮箱处发出异响再次登机检查，拖动桨叶，发现已无法进行开桨，只能往方向进行变桨，且只能拖动左右，就卡滞不动作检查变桨轴承以及齿面，未发现异常，变桨轴承排除的油脂里面也未发现金属粉末以及颗粒根据故障现象和异响情况，怀疑减速器低速级行星齿轮断裂卡死。",\n' +
    '                        "ration": 0.6\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "13. 现场运维人员登机检查发现轴机的流互感器有烧坏的痕迹故判断为机电流互感器损坏。",\n' +
    '                        "ration": 0.81\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "14. 现场自行维修。",\n' +
    '                        "ration": 0.73\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "15. 登机检查发现轴桨电机过载触发后备电源紧急收桨报出故障检查轴桨电机发现电机电枢绕组对地短路更换变桨电机。",\n' +
    '                        "ration": 0.64\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "e1904481-1925-4302-b138-1934eb12f3c3",\n' +
    '                    "7124ad06-16c5-44b3-94ff-f0f371aa1aa9",\n' +
    '                    "4c032299-5894-4a4c-a6a5-736603f3c398",\n' +
    '                    "cd7f1bdd-df4e-4aef-a4cd-b7a3d2f3e350",\n' +
    '                    "e1f7f7bb-6006-4fa2-89fd-76b6fa8ce7a7",\n' +
    '                    "2f343ab7-1b74-4621-9513-fa8e83e90da0",\n' +
    '                    "5db0e586-06dc-4b6b-b509-ac4568b80d89",\n' +
    '                    "4784d99d-3154-4da0-8bed-419078659904",\n' +
    '                    "e1ecea2a-1dbd-4f51-a5e3-dac709e3fe0e",\n' +
    '                    "c9c91df9-e2fe-479e-9ea8-f1cfc0e59ed7",\n' +
    '                    "08ed30ee-2e37-46f3-813d-5f625298f911",\n' +
    '                    "dceec341-41ce-4148-8630-683130f93c9d",\n' +
    '                    "659ae9e4-de19-4232-be0e-91e3c922cbce"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机编码器软连接技改",\n' +
    '                "faultNum": 10,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 手动转检查动编码器旋转轴发现桨桨码器转动轴卡涩严重。",\n' +
    '                        "ration": 0.88\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "60745ebb-65a1-4c09-91be-a5f39cb06d26",\n' +
    '                    "4320de49-dfd8-47be-be1d-6ede9912f590",\n' +
    '                    "0906b3ce-6ce6-4ab5-812f-e19acdcf20e1",\n' +
    '                    "42c930e2-904d-4f84-ba7e-cf0df857db55",\n' +
    '                    "aea78fc9-7d2e-4a3d-9d47-76fdc3d7b8bb",\n' +
    '                    "4b662f15-dc57-4f12-b0bf-736d14b21d87",\n' +
    '                    "6df995bd-c52a-4fcb-ae06-116482efc0c4",\n' +
    '                    "c2dd7dea-ce41-4602-ad57-1113e7812eb8",\n' +
    '                    "4f6f22d3-b01b-4d87-b0a1-7d5d5a2591b9",\n' +
    '                    "b78ee611-576c-4192-a688-64f7bd6a6811"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "伺服驱动器1故障",\n' +
    '                "faultNum": 9,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查发现观察轴面变桨电机启机是电流,其余俩面均正常检查变桨电机抱闸发现电机抱闸没有反应检查接触器无异常更换现场返修备件。",\n' +
    '                        "ration": 0.93\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 检查轴备电源异常，充电器不能正常充电，拔掉电机C插头后，后备电源恢复充电故判断变桨电机存在放电问题。",\n' +
    '                        "ration": 0.83\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 更换变桨电机以及驱动器检查发现变桨驱动器的后备电源输入接口，串电。",\n' +
    '                        "ration": 0.59\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "886becc9-c619-4104-a67d-3e0558148ea6",\n' +
    '                    "3527eb98-ae1e-45dd-893e-29d4871dba16",\n' +
    '                    "858c16e0-fb52-48d2-b9f7-68e34786d76a",\n' +
    '                    "e662b26f-51aa-4b4b-920b-17f2fee6719e",\n' +
    '                    "669695b3-ab1f-47f9-b18b-44109ec557ec",\n' +
    '                    "1a326559-7b88-4d85-967a-cce8834ec7e9",\n' +
    '                    "b1132334-786a-48c6-93f3-36c307153145",\n' +
    '                    "0324860e-32d2-4151-8c82-a31aab0bae1f",\n' +
    '                    "ce9a8934-1c19-4582-8295-debd1026dd96"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机2过流",\n' +
    '                "faultNum": 8,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 人员检查发现为变桨电机轴承卡涩导致电机过流损坏。",\n' +
    '                        "ration": 0.69\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 风机报桨叶机过流检查发现轴制柜流桥损坏测量正反两项导通需更换整流桥。",\n' +
    '                        "ration": 0.99\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 报此故障时桨叶桨速度过慢登机检查驱动器以及读取内部数据，驱动器报漏电检查变桨电机测量变桨电机绕组对地短路，且电机有糊味更换变桨电机。。",\n' +
    '                        "ration": 0.82\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "4. 检查面叶片螺栓解决断裂叶片螺栓问题清理齿轮箱齿面。",\n' +
    '                        "ration": 0.58\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "5eba90f2-cf89-464c-bae2-730c47e5d77f",\n' +
    '                    "c4977689-76b2-4390-878b-b4f1a61ab77b",\n' +
    '                    "7ff144fb-fd15-4961-bbdd-2dc18a35d7d2",\n' +
    '                    "5e391c1c-33cc-4f14-b938-d250f6382313",\n' +
    '                    "12fef817-7bdb-46c0-9d9f-2db37ab21be1",\n' +
    '                    "8a25a944-5c9f-4ba4-9624-b20dc7f142d2",\n' +
    '                    "164b2da4-1921-4c24-bed5-d6ac57fbf038",\n' +
    '                    "c34331f0-9685-4891-bec1-061b40e25aaf"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "桨叶间角度偏差大",\n' +
    '                "faultNum": 8,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 登机检查接线无异常，手动变桨，发现轴机异响严重，判定为轴承损坏。",\n' +
    '                        "ration": 0.57\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 根据导出数据分析桨三桨叶未收回登机发现桨叶在位置来回动作，并无抱闸动作声音进行手操盒开桨收桨，也没有抱闸声音。",\n' +
    '                        "ration": 0.73\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "3. 检查变桨电机编码器信号线检查变桨电机轴承是否卡死。",\n' +
    '                        "ration": 0.91\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "713d2b61-91df-427e-96d0-bfae55e0ce50",\n' +
    '                    "04be9add-ac7d-4ba1-8228-60250a20cd10",\n' +
    '                    "d6a54b01-eaf5-4dc9-a1fa-d6850458a0e6",\n' +
    '                    "810b0475-c85f-4272-b5ef-3febe55ad8a3",\n' +
    '                    "246bb125-f1f3-48df-8d23-0faeb08bdf37",\n' +
    '                    "5c187225-2652-44c2-9ab7-39af56e15671",\n' +
    '                    "9e7064b7-64fa-4fa3-8bff-034048fdeaac",\n' +
    '                    "e0d6b5d1-7659-4bc1-92e6-77846f8c63bc"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机2热继保护",\n' +
    '                "faultNum": 7,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 现场检查发现轴桨电机继电器（损坏并造成部分线缆烧坏，需进行更换处理其余检查未发现异常情况。",\n' +
    '                        "ration": 0.82\n' +
    '                    },\n' +
    '                    {\n' +
    '                        "measures": "2. 检查发现第二面变桨电机对地短路，且变桨C插头与电机连接端打火，导致C插头损坏。",\n' +
    '                        "ration": 0.83\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "334c6ac3-02cc-4fe6-b35e-213876a416ca",\n' +
    '                    "29ed8857-d872-4142-b215-bef42c18100f",\n' +
    '                    "40c86143-e643-47de-853f-ec55a8a1ae30",\n' +
    '                    "6deacda8-e1c5-4eb9-9511-7465bfe44bd1",\n' +
    '                    "0a10dded-6fd6-4f61-969d-d99c07b87c21",\n' +
    '                    "d8bf9d3e-8b1e-49c6-b143-397881dabc0d",\n' +
    '                    "3172dcd9-02f0-42af-b4e6-b8dc21968aef"\n' +
    '                ]\n' +
    '            },\n' +
    '            {\n' +
    '                "faultName": "变桨电机2超速",\n' +
    '                "faultNum": 6,\n' +
    '                "maintenanceMeasures": [\n' +
    '                    {\n' +
    '                        "measures": "1. 风机报变桨机超速，运行时变桨电机A编码器角度突然跳变登塔检查A编码器接线回路均正常，现场判断为A编码器内部损坏，需更换。",\n' +
    '                        "ration": 0.77\n' +
    '                    }\n' +
    '                ],\n' +
    '                "caseUuid": [\n' +
    '                    "c6782ea8-1938-4be0-b1ca-8d8c267abb5c",\n' +
    '                    "a2d6a615-47d1-41e9-a358-5819f6bfde83",\n' +
    '                    "3986aa40-71cf-48b0-a94d-c817a6865cce",\n' +
    '                    "99cae1ad-27c9-47ca-95e8-65aee3aa0af3",\n' +
    '                    "31a3df47-5e40-46cc-9a66-b8b6f947dbf3",\n' +
    '                    "c104f02c-b308-40d9-9c30-9ea81e09bafc"\n' +
    '                ]\n' +
    '            }\n' +
    '        ]\n' +
    '    }\n' +
    ']'
